Revit 2027 API
FabricationPart.IsDimensionCalculated Method
 Checks if the fabrication dimension is calculated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsDimensionCalculated(
	FabricationDimensionDefinition dim
)
Public Function IsDimensionCalculated (
	dim As FabricationDimensionDefinition
) As Boolean
public:
bool IsDimensionCalculated(
	FabricationDimensionDefinition^ dim
)
member IsDimensionCalculated :
        dim : FabricationDimensionDefinition -> bool
Parameters
dim FabricationDimensionDefinition
 The fabrication dimension.
Return Value
Boolean
 True if the fabrication dimension is calculated.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace